In [1]:
# importaciones
import pandas as pd
import numpy as np

import os
import sys

ruta = r"c:\Users\antonio\Desktop\Proyecto_Final_Data\src"  # Ruta a src
sys.path.append(ruta)  
import sp_limpieza

from sp_limpieza import limpiar_nombres_columnas 
from sp_limpieza import valores_unicos

In [2]:
# carga y lectura de archivos(cities)
ruta = "../data/data_raw/cities.csv"
df_cities_raw = pd.read_csv(ruta)

In [3]:
#creamos copia entes empezar la limpieza y transformacion
df_cities = df_cities_raw.copy()

In [4]:
print(df_cities.shape)  # Devuelve (filas, columnas)
df_cities.info() # Muestra informacion general
df_cities.head() # Muestra las primeras filas

(96, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 96 entries, 0 to 95
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   CityID     96 non-null     int64
 1   CityName   96 non-null     object
 2   Zipcode    96 non-null     int64
 3   CountryID  96 non-null     int64
dtypes: int64(3), object(1)
memory usage: 3.1+ KB

   CityID        CityName  Zipcode  CountryID
0       1          Dayton    80563         32
1       2         Buffalo    17420         32
2       3         Chicago    44751         32
3       4         Fremont    20641         32
4       5  Virginia Beach    62389         32

In [5]:
# Verificar duplicados en CityID
print("Duplicados en CityID:", df_cities["CityID"].duplicated().sum())
# Verificar duplicados en CityName
print("Duplicados en CityName:", df_cities["CityName"].duplicated().sum())

Duplicados en CityID: 0
Duplicados en CityName: 0

In [6]:
#verificamos que CountryID es siempre el mismo valor y no aporta nada a nuestro df
df_cities["CountryID"].value_counts()

CountryID
32    96
Name: count, dtype: int64

In [7]:
# Eliminamos columna
df_cities = df_cities.drop(columns=["CountryID"])
print(df_cities.head())  # Verificamos que ya no estÃ©

   CityID        CityName  Zipcode
0       1          Dayton    80563
1       2         Buffalo    17420
2       3         Chicago    44751
3       4         Fremont    20641
4       5  Virginia Beach    62389

In [8]:
# El codigo postal esta como int y deberia ser un str (son identificadores, no valores numÃ©ricos)
df_cities["Zipcode"] = df_cities["Zipcode"].astype(str)
# Verificar el cambio
print(df_cities.dtypes)

CityID       int64
CityName    object
Zipcode     object
dtype: object

In [9]:
df_cities = limpiar_nombres_columnas(df_cities)
df_cities.head()

   City_Id       City_Name Zipcode
0        1          Dayton   80563
1        2         Buffalo   17420
2        3         Chicago   44751
3        4         Fremont   20641
4        5  Virginia Beach   62389

In [10]:
valores_unicos(df_cities)

ðŸ”¹ Valores Ãºnicos en 'City_Id':
[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24
 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48
 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72
 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96]

ðŸ”¹ Valores Ãºnicos en 'City_Name':
['Dayton' 'Buffalo' 'Chicago' 'Fremont' 'Virginia Beach' 'Austin'
 'Riverside' 'Arlington' 'Atlanta' 'Toledo' 'Spokane' 'Tacoma' 'Akron'
 'Indianapolis' 'Colorado' 'Norfolk' 'St. Louis' 'Little Rock' 'Omaha'
 'El Paso' 'Milwaukee' 'Baton Rouge' 'Anaheim' 'Lincoln' 'Boston'
 'Des Moines' 'Mesa' 'Tucson' 'Washington' 'Philadelphia' 'Wichita'
 'Jackson' 'Minneapolis' 'Fort Wayne' 'Greensboro' 'Detroit' 'Fresno'
 'Richmond' 'Lubbock' 'Cleveland' 'Bakersfield' 'Denver' 'Glendale'
 'Memphis' 'Dallas' 'New York' 'San Francisco' 'Long Beach' 'Montgomery'
 'Cincinnati' 'Portland' 'Madison' 'Las Vegas' 'Albuquerque' 'Houston'
 'Stockton' 'Nashville' 'Columbus' 'Kansas' 'Fort Worth' 'Miami' 'Mobile'
 'Tulsa' 'Raleigh' 'Baltimore' 'Shreveport' 'Corpus Christi' 'Anchorage'
 'Oakland' 'Rochester' 'Phoenix' 'Honolulu' 'Santa Ana' 'Tampa'
 'San Antonio' 'Birmingham' 'Louisville' 'San Diego' 'Oklahoma'
 'New Orleans' 'Sacramento' 'Charlotte' 'Aurora' 'Newark' 'St. Petersburg'
 'San Jose' 'Los Angeles' 'Seattle' 'St. Paul' 'Grand Rapids'
 'Jacksonville' 'Hialeah' 'Jersey' 'Yonkers' 'Garland' 'Pittsburgh']

ðŸ”¹ Valores Ãºnicos en 'Zipcode':
['80563' '17420' '44751' '20641' '62389' '781' '1439' '12654' '66212'
 '52048' '38103' '43085' '83448' '81678' '88609' '88825' '19382' '81251'
 '24733' '95963' '78846' '21874' '21500' '95386' '59548' '40742' '60852'
 '34760' '63454' '17498' '93028' '40971' '95451' '48982' '35659' '72819'
 '90795' '72757' '58464' '51352' '13915' '18752' '32198' '73999' '20151'
 '17104' '157' '97859' '8944' '83634' '79636' '14626' '90989' '55358'
 '95800' '46777' '60874' '87987' '56647' '41769' '6794' '78861' '69923'
 '20327' '89197' '82101' '78414' '29493' '29029' '415' '84193' '93782'
 '23419' '81280' '3863' '14935' '4409' '83701' '40472' '35640' '81966'
 '39774' '40050' '31536' '88713' '45666' '63756' '20135' '77998' '70862'
 '68274' '34375' '55355' '7430' '73265' '14257']

In [11]:
df_cities.describe().T

         count  mean        std  min    25%   50%    75%   max
City_Id   96.0  48.5  27.856777  1.0  24.75  48.5  72.25  96.0

In [12]:
df_cities.to_csv("../data/data_limpios/cities_clean.csv", index=False)